Catalogs/ЛБ_Залогодатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Залогодатели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>Отчество</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>Фамилия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехническоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_lx</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_Залогодатели/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ЗаполнитьОтборыРегистров()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда				
		Отбор = ДокументыЗалогодателя.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументЗалогодателя.Владелец");
	    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	    Отбор.Использование  = Истина;
	    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	    Отбор.ПравоеЗначение = Объект.Ссылка;
		
		Отбор = КонтактнаяИнформацияЗалогодателя.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Залогодатель");
	    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	    Отбор.Использование  = Истина;
	    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	    Отбор.ПравоеЗначение = Объект.Ссылка;
	КонецЕсли;	
	
КонецПроцедуры
	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если РольДоступна("ПриемщикЛомбарда")
	//	И Не РольДоступна("ПолныеПрава") Тогда
	//	
	//	ТолькоПросмотр = Истина;
	//	
	//КонецЕсли;
	
	ЗаполнитьОтборыРегистров();
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Для каждого ЭлементОтбор Из Элемент.Отбор.Элементы Цикл
			ЭлементОтбор.ПравоеЗначение = ТекущаяДата();
		КонецЦикла;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = СокрЛП(Объект.Фамилия) + " " + СокрЛП(Объект.Имя) + " " + СокрЛП(Объект.Отчество);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьОтборыРегистров();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаДокумент.Доступность = Истина;
		Элементы.ГруппаКонтактныеДанные.Доступность = Истина;
	Иначе
		Элементы.ГруппаДокумент.Доступность = ложь;
		Элементы.ГруппаКонтактныеДанные.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПараметрыФормы = Новый Структура;
	//	ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
	//	
	//	ОткрытьФорму("РегистрСведений.ЛБ_ДокументыЗалогодателей.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Иначе	
	//	Сообщить("Документ не записан. Необходимо сначала записать документ.", СтатусСообщения.Информация);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияЗалогодателяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПараметрыФормы = Новый Структура;
	//	ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
	//	
	//	ОткрытьФорму("РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Иначе	
	//	Сообщить("Документ не записан. Необходимо сначала записать документ.", СтатусСообщения.Информация);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	Объект.Фамилия = ТРег(Объект.Фамилия);
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Объект.Имя = ТРег(Объект.Имя);
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Объект.Отчество = ТРег(Объект.Отчество);
	СформироватьНаименование();
КонецПроцедуры

&НаСервере
Функция ПроверитьФИОЗалогодателя(Фамилия, Имя, Отчество)
    //Проверим правильность заполнения ФИО
	СтруктураВозврата = ЛБ_ОбщийМодуль.ПроверитьФИОЗалогодателя(Фамилия, Имя, Отчество);
	Если НЕ СтруктураВозврата.Результат Тогда
		Сообщить(СтруктураВозврата.Сообщение, СтатусСообщения.Важное);
	КонецЕсли;
	Возврат СтруктураВозврата.Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ПроверитьФИОЗалогодателя(Объект.Фамилия, Объект.Имя, Объект.Отчество) Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти
